app/controllers/albums_controller.rb

  def create
    @album = Album.new(album_params)

    respond_to do |format|
      if @album.save
---
INSERT INTO "albums" ("artist", "title", "year", "track_list", "album_art_url", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @album.update(album_params)
---
UPDATE "albums" SET "year" = ?, "updated_at" = ? WHERE "albums"."id" = ?  [["year", "1967"], ["updated_at", "2016-08-29 03:24:15.159945"], ["id", 1]]

  def destroy
    @album.destroy
---
DELETE FROM "albums" WHERE "albums"."id" = ?  [["id", 1]]