app/controllers/arts_controller.rb

SELECT "arts".* FROM "arts"
---
  def index
    @arts = Art.all

INSERT INTO "arts" ("artist", "year", "image_url", "description", "title", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @art = Art.new(art_params)

    respond_to do |format|
      if @art.save

DELETE FROM "arts" WHERE "arts"."id" = ?  [["id", 1]]
---
  def destroy
    @art.destroy

SELECT  "arts".* FROM "arts" WHERE "arts"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_art
      @art = Art.find(params[:id])